//输入工资数，计算出个人所得税并打印。

#include <stdio.h>
 int main(){
 int s,tax;
 printf("请输入工资数:\n");
 scanf("%d",&s);
if(s<=3500){
  printf("不交税！\n");
}
else if(s>=3501 && s<=5000){
   tax=(s-3500)*0.03;
}
else if(s>=5001 && s<=8000){
   tax=(s-5000)*0.1+45;
}
else if(s>=8001 && s<=12500){
   tax=(s-8000)*0.2+300+45;
}
else if(s>=12501 && s<=38500){
   tax=(s-12500)*0.25+900+300+45;
}
else if(s>=38501 && s<=58500){
   tax=(s-38500)*0.3+6500+900+300+45;
}
else if(s>=58501 && s<=83500){
   tax=(s-58500)*0.35+6000+6500+900+300+45;
}
else{
   tax=(s-83500)*0.45+8750+6000+6500+900+300+45;
}
    printf("交税%d\n",tax);
    return 0;
}
